const lenguaje = () => { return 'ar' } //Arabe 

//index.js
const tmp = () => { return `╭━─━─━─≪🔆≫─━─━─━╮\n│ تم تنظيف مجلد تمب بشكل صحيح\n╰━─━─━─≪🔆≫─━─━─━╯` } 
const session = () => { return `🟢 لا يوجد ملف لحذفه` } 
const errorsession = () => { return `🟢 حدث خطأ ما أثناء الحذف، ولم يتم حذف الملف` }
const archivo = () => { return `🟢 أرشيف` }
const archborrado = () => { return ` تم الحذف بنجاح` }
const archivoborrado = () => { return ` لم يتم الحذف` }
const purgesessions = () => { return `╭━─━─━─≪🔆≫─━─━─━╮\n│ عمليات التطهير التلقائي\n│ الملفات المحذوفة ✅\n╰━─━─━─≪🔆≫─━─━─━╯` }
const purgesubbots  = () => { return `╭━─━─━─≪🔆≫─━─━─━╮\n│ AUTO_PURGE_SESSIONS_SUB-BOTS\n│ الملفات المحذوفة ✅\n╰━─━─━─≪🔆≫─━─━─━╯` }
const purgeoldfiles = () => { return `╭━─━─━─≪🔆≫─━─━─━╮\n│AUTO_PURGE_OLDFILES\n│ الملفات المحذوفة ✅\n╰━─━─━─≪🔆≫─━─━─━╯` }

//call
const smscall = () => { return ` سيتم منعك*\n_السبب: لقيامك بإنشاء` }
const smscall2 = () => { return `*إذا اتصلت عن طريق الخطأ، فاتصل بمنشئ المحتوى الخاص بي لإلغاء حظرك.*` }

//antiprivado
const smsAntiPv = () => { return `يُمنع التحدث إلى الرسائل الخاصة للبوت، ولهذا السبب سيتم منعك*\n*لاستخدام البوت، انضم إلى مجموعة البوت` } 

//detec 
const smsAvisos = () => { return `[ 🔒 مجموعة مغلقة ]` } 
const smsAvisos2 = () => { return `「 إعدادات المجموعة 」\n\n* الآن يمكن للمسؤولين فقط كتابة المجموعة*` }
const smsAvisos3 = () => { return `[ 🔓 مجموعة مفتوحة ]` }  
const smsAvisos4 = () => { return `「 إعدادات المجموعة 」\n\n*الآن يمكن لجميع المشاركين إرسال الرسائل 🗣️*` }  
const smsAvisos5 = () => { return `「 إعدادات المجموعة 」\n\n` } 
const smsAvisos6 = () => { return `*الآن يمكن للمسؤولين فقط تعديل إعدادات المجموعة*` }  
const smsAvisos7 = () => { return `يمكن لجميع المشاركين الآن تعديل إعدادات المجموعة` } 
const smsAvisos8 = () => { return `تم تغيير الوصف الوصف الجديد هو` } 
const smsAvisos9 = () => { return `*تم تغيير اسم المجموعة إلى أسماء جديدة:*` }

//welcome
const smsWel =  () => { return `ساعة` } 
const smsWel2 = () => { return `¿ كيف حالك? 😃` }
const smsWel3 = () => { return `¿ كيف حالك? 😃\n\n『Bienvenido A` }
const smsWel4 = () => { return ` تشرفت بلقائك يا صديق 🤗\n\n_تذكر قراءة قواعد المجموعة حتى لا تواجه أي مشاكل 🧐_\n\n*فقط استمتع بهذه المجموعة واستمتع بوقتك🥳*` }
const smsWel5 = () => { return `[ عضو جديد ]\n\n` }
const smsWel6 = () => { return `نحن نرحب بكم` }  
const smsWel7 = () => { return `⪨────[ مرحباً ]────⪩\n\n` }
const smsWel8 = () => { return `💫 *مرحبا بك في :*` }
const smsWel9 = () => { return `💫 *شارك*` }
const smsWel10 = () => { return `💫 *تاريخ*` }
const smsWel11 = () => { return `📢 *اقرأ الوصف* 📢\n` }
const smsBye = () => { return ` وداعا` }
const smsBye2 = () => { return ` حسنا لقد ذهب` }
const smsBye3 = () => { return ` يرحمك الله 😎` }
const smsBye4 = () => { return ` غادر المجموعة._` }
const smsBye5 = () => { return ` غادر أحد معجبي BTS` }
const promote = () => { return ` تهانينا، أنت الآن جزء من الموظفين.🎉` }
const demote = () => { return ` أنت لم تعد المشرفين 🥲` }

//mensaje el la consola inicio
const smsConexion = () => { return `🟢 قام المستخدمون بتسجيل الدخول =>` } 
const smsEscaneaQR = () => { return ` قم بمسح QR، وانتهى الأمر بـ 45 ثانية...` }
const smsConectado = () => { return ` لقد تم توصيله بشكل صحيح بالفعل` }
const smsConexioncerrar = () => { return `⚠️ تم إغلاق الاتصال، محاولة لإعادة الاتصال` }

//autobio
const Bio = { 
text: `🦁 ɴᴏᴠᴀʙᴏᴛ - لدي:`,   
text2: `يمكن للمستخدمين الذين يستخدمونني الاستجابة ببطء، وسرعة استجابتي هي:`,
text3: `🎅 ɴᴏᴠᴀʙᴏᴛ-ᴍᴅ في الطب | أصل ✅️:`,    
text4: `لعرض قائمة الأوامر الخاصة بي، استخدم: #menu`,   
text5: `ɴᴏᴠᴀʙᴏᴛ بواسطة ʟᴏʟɪʙᴏᴛ - اشترك في قناتنا على اليوتيوب 🔔\nhttps://www.youtube.com/@elrebelde.21`, 
text6: `✅ نشاط:`,  
text7: `👥 المستخدمين:` }

//antiarabe
const smsAntiFake = () => { return `✳️ غير مسموح بهذه المجموعة، سيتم طرد الرقم المزيف...` }
const smsAntiArabe = () => { return `✳️ في هذه المجموعة، لا يسمح بالأرقام العربية حتى المرة القادمة....` }

//antilink
const smsAntiLink = () => { return `\`\`\`「 تم اكتشاف الارتباط المضاد 」\`\`\`\n\n` }
const smsAntiLink2 = () => { return `🤨 هذا غير مسموح به، سيتم طردك من المجموعة....` }
const smsAntiLink3 = () => { return ` أنقذك، أنا لست مسؤولًا 🙄\n\n*[ نداء للمسؤولين ]*` }
const smsAntiLink4 = () => { return `ᴱˡ ᵇᵒᵗ ⁿᵉᶜᵉˢᶦᵗᵃ ᵃᵈᵐᶦⁿ ᵖᵃʳᵃ ᵉˡᶦᵐᶦⁿᵃʳ ᵃ ᵉˢᵗᵃ ˢᵘᶜᶦᵃ ʳᵃᵗᵃ` } 
const smsAntiLink5 = () => { return `يحتاج الروبوت إلى مسؤول للقضاء على هذا الجرذ القذر :v` }
 
//autosticker
const smsAutoSicker = () => { return `🤡 مهلا، أين بحق الجحيم رأيت عصا تدوم طويلا يا غبي 🤣. (الحد الأقصى 15 ثانية)` }

//autonivel
const smsAutonivel = () => { return `*「 مستوى السعادة يصل 🆙🥳 」*\n\n🥳 هتافات` }
const smsAutonivel2 = () => { return `👏 لقد ارتقيت بالمستوى، استمر في ذلك 👏\n` }
const smsAutonivel3 = () => { return `*🎅 مستوى :*` }
const smsAutonivel4 = () => { return `*🎅 المستوى السابق :* ` }
const smsAutonivel5 = () => { return `*🎅 المستوى الحالي :*` }
const smsAutonivel6 = () => { return `*🎅 يتراوح :*` }
const smsAutonivel7 = () => { return `*🎅 تاريخ :*` }
const smsAutonivel8 = () => { return `_* لمعرفة ما هو المنفذ العلوي لديك، أدخل الأمر #lb*_` }
const smsAutonivel9 = () => { return `*🎅 تهانينا على الوصول إلى مستوى جديد 🎊*\n\n` }

//info  
const nivel = () => { return `[ ❇️ ] بحاجة إلى المستوى` }
const nivel2 = () => { return `لتتمكن من استخدام هذا الأمر، تحقق من مستواك الحالي باستخدام الأمر` } 
const admin = () => { return `*⚠️ أنت لست مسؤولاً 🤡 يمكن للمسؤولين فقط استخدام هذا الأمر*` } 
const botAdmin = () => { return `*⚠️ مرحبًا، أولاً الروبوت (أنا)، أحتاج إلى أن أكون مسؤولاً لاستخدام هذا الأمر*` }
const propietario = () => { return `*⚠️ من أنت بحق الجحيم؟ مديري فقط يمكنه استخدام هذا الأمر*` }
const group = () => { return `*⚠️ أيها الأحمق، هذا الأمر لا يمكن استخدامه إلا من قبل المجموعة*` }
const private = () => { return `*⚠️ لا يمكن استخدام هذا الأمر إلا في الدردشة الخاصة*` }
const bot = () => { return `*⚠️ لا يمكن استخدام هذا الأمر إلا بواسطة ( أنا)*` }
const error = () => { return `⪨╼╼≪⚠️ خطأ ⚠️≫╾╼⪩\n\nحدث خطأ غير متوقع، (واجهة برمجة التطبيقات معطلة 😢)` }
const AvisoMG = () => { return `⪨╼╼≪⚠️ عمل يساء استخدامه ⚠️≫╾╼⪩\n\n` }
const advertencia = () => { return `[ ⚠️ تحذير ]` }  
const registra = () => { return `*[ 🔴 مرحبًا، توقف، أنت غير مسجل 🔴 ]*\n\nأنت لا تظهر في قاعدة البيانات الخاصة بي ✋\n\nلكي تتمكن من استخدام الروبوت، يجب أن تكون مسجلاً:\n\n#reg اسم.عمر` } 
const limit = () => { return `*الماس 💎 الاستخدام*` }
const AntiNsfw = () => { return `*تم تعطيل الأمر 18*\nإذا كنت مسؤولاً وتريد تنشيطه، فاستخدم:\n• modocaliente on` } 
const endLimit = () => { return `*😢 لا يوجد لديك المزيد من الماس 💎*\n\nيمكنك شراء المزيد باستخدام الأمر: #buy` }
const exito = () => { return `*ناجح ✅*` }
const result = () => { return `*نتائج :*` }

//Buscadores
const lengua = { 
ejem: `مثال :`, 
ejemplo: `*ما هو محرك البحث هذا؟\n*مثال:*`, 
opcion: ` خيار :`, 
tipo: ` يكتب :`, 
id: ` معرف الفيديو :`, 
titulo: ` عنوان :`, 
Peso: `*وزن :*`, 
artista: `الفنانين`, 
album: `الألبوم`,   
vista: ` الآراء :`, 
publi: `نشرت`, 
dura: ` مدة :`,  
subidos: ` تم الرفع :`, 
calidad: ` جودة :`, 
desc: ` وصف :`, 
text: ` أدخل رابطًا للاختصار!`, 
trad: `🔸 ترجمة`,  
text2: `*والنص?*`, 
ia: `*⚠️ أدخل النص الذي تريد البحث عنه؟*\n\n*• مثال :*\n`, 
ia2: `*⚠️ أدخل نصًا لإنشاء صورة لاستخدام وظيفة DALL-E*\n\n*• مثال:*\n`,
espere: `⏳ *انتظر لحظة....*`, 
aguarde: `⏳ *معالجة الصورة، انتظر لحظة....*`,  
responde: `*[ ⚠️ ] إرسال/الرد على الصورة مع الأمر :`,  
incorrecto: `*[ ⚠️ ] تنسيق الملف غير قابل للمشاركة، إرسال/الرد على الصورة*`,   
hd: `*هنا هي الصورة عالية الدقة*\n\nإذا لم تظهر الصورة، يستجيب عالية الدقة للصورة بالأمر مرة أخرى`, 
error: `تعذر تنزيل الفيديو الخاص بك، يرجى المحاولة مرة أخرى`  
}

//convertidores
const sms = {
text: `*قم بالرد على الصوت الذي تريد تغييره باستخدام الأمر:*`, 
text2: `*قم بالرد على صورة/فيديو لتحويل عنوان url`, 
text3: `*[ ⚠️ ] الرد على الصوت*`, 
text4: `*والملصق؟*\n*يستجيب لرئيس الملصقات*`,  
text5: `*🕔 انتظر لحظة....*\nأقوم بتحويل الصورة إلى تصميم أنمي، كن صبورًا عند إرسال النتيجة`,  
text6: `*تأكد من ظهور وجه الشخص في الصورة*`,   
text7: `والصورة؟ قم بالرد أو وضع علامة على الصورة*`
}

const info = { 
text: `حالة البوت`,  
text2: `➢ فرع الخادم :`,  
text3: `➢ منصة :`,  
text4: `➢ بعبارة أخرى :`, 
text5: `➢ استخدام وحدة المعالجة المركزية :`,  
text6: `➢ الذاكرة الاجمالية :`, 
text7: `➢ المستخدمين :`,   
text8: `➢ أصل :`,  
text9: `➢ طريق :`,   
text10: `➢ بوت ثانوي نشط :`, 
text11: `➢ أنا روبوتات فرعية :`,  
text12: ` هذا الروبوت قيد التطوير إذا كنت تريد، اتصل بمنشئي هنا وأترك ​​لك رقمه\n\nلا ترسل بريدًا عشوائيًا إلى منشئ المحتوى أو تحظره`,   
text13: `*مرحبا عزيزي المستخدمين 👋🏻, أدعوكم للانضمام إلى المجموعات الرسمية لعائلتي ᴛʜᴇ-ʟᴏʟɪʙᴏᴛ-ᴍᴅ وɴᴏᴠᴀʙᴏᴛ-ᴍᴅ، للتعايش مع المجتمع :ᴠ*\n\n*➤ المجموعات الرسمية للبوت:*`,   
text14: `*➤ مجموعات التعاون:*`,  
text15: `*➤ مجموعة اختبار لاختبار بوت:*`, 
text16: `*➤ تعرف على تحديثات بوت الجديدة هنا:*`,  
text17: `*➤ مجموعة مساعدة البوت:*`,   
text18: `• مجموعات الصداقة حيث يوجد الروبوت`, 
text19: `إذا كنت تريد أن تظهر مجموعتك هنا، تحدث إلى منشئ المحتوى الخاص بي`,  
text20: `╭─────────────┈⊷
│ \`\`\`كيفية تثبيت هذا الروبوت?\`\`\` 
╰┬────────────┈⊷
┌┤\`\`\`📌 متطلبات التثبيت\`\`\`
┌┤❇️ _شكوك: wa.me/5492266466080_
┌┤❇️ _درس تعليمي: https://youtu.be/OhbJjp0L2QA?si=ZqRgG3SGTRFSW6CH_
┌┤❇️ _1 جيجابايت من مساحة التخزين_
┌┤❇️ _ترموكس: https://www.mediafire.com/file/3hsvi3xkpq3a64o/termux_118.apk/file_
┌┤❇️ _جيثب: https://github.com/elrebelde21/NovaBot-MD_ 
┌┤❇️ _واتس اب مناعي (ثانوي)_
┌┤❇️ _رقم افتراضي (رقم آخر)_
┌┤❇️ _جهازين أو جهاز كمبيوتر واحد للمسح الضوئي_
╰────────────┈⊷

 \`\`\`📌 أمر تثبيت ترموكس\`\`\`

> termux-setup-storage

> apt update && apt upgrade && pkg update && pkg upgrade && pkg install bash && pkg install libwebp && pkg install git -y && pkg install nodejs -y && pkg install ffmpeg -y && pkg install wget && pkg install imagemagick -y && pkg install yarn

> git clone https://github.com/elrebelde21/NovaBot-MD && cd NovaBot-MD && yarn && npm install

> npm start

(مسح ريال قطري بسرعة)
 
🚀 --------[ مضيف Vortexuscloud ]--------- 🚀
💞 شكرا ل: mauro 
 
• https://youtube.com/@vortexuscloud

• الصفحة الرسمية :
https://vortexuscloud.com

• لوحة القيادة:
https://dash.vortexuscloud.com

• لوحة:
https://panel.vortexuscloud.com

• قناة واتساب حول معلومات المضيف
• https://whatsapp.com/channel/0029Va8ZD6O3mFXxTPl1m13A`, 
text21: `*أدخل الأمر مع وجود أخطاء*\n\n*مثال:`,  
text22: `تم إرسال التقرير إلى منشئي، سنتواصل معك إذا لزم الأمر، إذا كان خاطئًا سيتم تجاهله وحظره من البوت*`, 
text23: `*╼╼╼╼╼╼╼[ 💖 هبة 💖 ]╾╾╾╾╾╾╾╾*\n\n* مرحبًا 👋، إذا كنت ترغب في دعم هذا المشروع، يمكنك ذلك من خلال التبرعات التطوعية من خلال سوق الدفع في الأرجنتين*\n\n╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍\n\n*❇️ سوق الدفع في الأرجنتين:*\n*• الاسم المستعار :* elrebelde21\n*• السيرة الذاتية :* 0000003100059201491917`,  
text24: `*💖 يمكنك أيضًا مشاركة ما يلي كإظهار للدعم 💕*\n\n*🎅 ادعم المستودع بنجمة صغيرة، شكرًا لك 🙏💕*`,  
text25: `┗❴ ⚠ تحذير ⚠ ❵┛\n\nيُحظر الإشارة إلى منشئي/مطوري البرامج إذا كان لديك اقتراح بخصوص الروبوت، فاكتبه إلى رسائلهم الخاصة` }

const menu = { 
text: `🎅 بادئة`, 
text2: `🎅 تاريخ :`,  
text3: `🎅 ساعة :`,  
text4: `🎅 إصدار :`,  
text5: `🎅 المستخدمين :`,   
text6: `🎅 نشاط :`, 
text7: `🎅 طريق :`,  
text8: `🎅 حدود :`,  
text9: `🎅 مستوى : `,  
text10: `🎅 يتراوح:`,  
text11: `🎅 مسجل :`,    
textt: `🎅 بوت ofc: هذا هو بوت ofc`, 
texttt: `🎅 أنا روبوت فرعي :`,  
text12: `\`\`\`🎅 قوائم الأوامر 🎅\`\`\`
\`\`\`بوت بسيط مع عدد قليل من الأوامر\`\`\``,  
text13: `*🎅 كلمات محددة للروبوت للتفاعل معك 🎅*`,  
text14: `_*كن حذرا، اكتب كما هو في الرسالة*_`,
text15: `🤔 *ما الجديد؟* 🤗\n\n*🌐 الإصدار الجديد:*`, 
text16: `*أمر جديد:*

🟢 متعدد اللغات الآن يمكنك اختيار اللغة التي تريد أن يرد عليها البوت:

• #idioma
• #lenguaje

المزيد من الأوامر، الإصدار المستقبلي يريد مني إضافة بعض الأوامر الخاصة، والكتابة إلى منشئ المحتوى الخاص بي`, 
text17: `*🌐 قواعد الروبوت 🌐*

*• لا ترسل أوامر غير مرغوب فيها*

استخدم الأوامر كل 5 ثوانٍ، وإلا فقد يصبح الروبوت مشبعًا، أو قد ينتقل رقم الروبوت إلى الدعم بسبب البريد العشوائي.

*• لا ترسل رابط المجموعة للبوت حتى يتمكن من الانضمام*

تحدث إلى خالقي وسوف ينضم إلى مجموعتك

*• لا تتصل بالروبوت أو المنشئ*

إذا قمت بذلك، سيتم منعك من البوت وحظرك` }

//jadibot.js
const jadibot = {
text: ` قم بمسح QR هذا ليصبح روبوتًا مؤقتًا

1) انقر على النقاط الثلاث في الزاوية اليمنى العليا
2) اضغط على واتساب ويب
3) مسح هذا QR
*تنتهي صلاحية QR بعد 45 ثانية*\n\n`,  
text2: ` طريقة جديدة لتجعل من نفسك روبوتًا فرعيًا

1) انقر على النقاط الثلاث في الزاوية اليمنى العليا
2) اضغط على واتساب ويب
3) انقر على الرابط الذي يحتوي على رمز الهاتف
4) الصق الكود أدناه\n\n`, 
text3: `*⚠️ تم تعطيل هذا الأمر من قبل المنشئ*`, 
text4: `*✅ أنت متصل بالفعل، تحلى بالصبر، جارٍ تحميل الرسائل...*`, 
text5: `*تم الاتصال بنجاح*`, 
text6: `× بوت :`, 
text7: `× مالك :`, 
text8: `*ملاحظة: * يمكن إعادة تشغيل البوت إذا توقف عن تلقي الأوامر، استخدم: #serbot أو المعرف الذي سيتم إرساله أدناه، لإعادة الاتصال`, 
text9: `*⚠️ الجهاز الذي تم قطع اتصاله سيتعين عليك إعادة الاتصال به #jadibot*`, 
text10: `*⚠️ إعادة إرسال الأمر....*`, 
text11: `[ ⚠️ ] مطلوب إعادة التشغيل، إعادة التشغيل...`, 
text12: `*⚠️ تم قطع اتصال الجهاز*\n\n*سيتعين عليك تسجيل الدخول مرة أخرى (استخدم .deljadibot)*`, 
text13: `*⚠️ تم إغلاق الاتصال*\n*حاول إعادة الاتصال بـ:`, 
text14: `[ ⚠️ ] تم فقد الاتصال بالخادم، إعادة الاتصال إجبارية`, 
text15: `*[ ⚠️ ] اتصالك غير صالح*\n*لن تتم إعادة الاتصال بك*`, 
text16: `[ ⚠️ ] انتهت مدة الاتصال.`, 
tex17: `[ ⚠️ ] خطأ غير معروف:\n`, 
text18: `*الروبوتات الفرعية المتصلة:*` } 
 
//descargar.js
const descargar = {
text: `*ما الذي تبحث عنه؟ أدخل اسم السمة*\n\nمثال:`, 
text2: `         *⌜ أغنية وجدت ✅⌟*`,
text3: `         *⌜ تم العثور على فيديو ✅⌟*`, 
text4: `*هنا أشرطة الفيديو الخاصة بك 👌*`, 
text5: `          *⌜ تم العثور على الصوت ✅⌟*`, 
text6: `*يرجى الانتظار عن طريق إرسال ملف mp3 الخاص بك ⚠*

*الخدمة مقدمة من NovaBot-MD*`, 
text7: `*يرجى الانتظار عن طريق إرسال ملف mp4 الخاص بك ⚠*

*الخدمة مقدمة من NovaBot-MD*`,  
text8: `*ما الذي تبحث عنه؟*\n*أدخل اسم أغنية Spotify.*`, 
text9: `*أين رابط github؟*\n\n*مثال :*`, 
text10: `*انتظر لحظة...*\n\nإذا لم يصل الملف، فهذا يعني أن المستودع ثقيل جدًا.`,    
text11: `*ما الذي تبحث عنه؟ أدخل عنوان/اسم الأغنية للبحث عن كلمات الأغاني*\n*مثال:*`, 
text12: `*اسم*`, 
text13: `*مقاس*`, 
text14: `*امتداد*`, 
text15: `لا أستطيع تحميل الملف يتجاوز الحد المسموح به وهو 900 ميجابايت\n`, 
text16: `*🎥 هنا هو الفيديو الخاص بك على الفيسبوك*`, 
text17: `*أدخل اسم المستخدم*\n\n*مثال:*`, 
text19: `*اسم المستخدم :*`, 
text20: `*متابعون :*`, 
text21: `*التالي :*`, 
text22: `*سيرة شخصية :*`, 
text23: `*المنشورات :*`, 
text24: `*[ ⚠️ ] ما APK الذي تبحث عنه؟?*`, 
text25: `*تنزيل ابتويد*`, 
text26: `*اخر تحديث`,  
text27: `*مقاس`, 
text28: `[ ⛔ ] الملف كبير جدًا لذا لن يتم إرساله.`, 
title: `*عنوان:*`, 
duracion: `*مدة:*`,
ago: `*نشرت:*`, 
autor: `*مؤلف:*`,
views: `*الآراء:*`, 
letra: `*خطاب:*`,   
music: `*• تحميل الصوت 🔊, انتظر لحظة....*`, 
vid: `*• تم تنزيل الفيديو 🎥, انتظر لحظة....*`,   
espere: `*🕔 انتظر لحظة....*`, 
audio: `*⏳يعالج....*\n\n_تم تنزيل الصوت، انتظر لحظة_`,  
video: `*⏳يعالج....*\n\n_لقد قمت بتنزيل الفيديو الخاص بك، انتظر لحظة_`, 
descargado: `_لقد قمت بتحميل الملف، انتظر لحظة...._` }

//enable.js 
const enable = {
text: `⪨╼╼≪⚠️ إجراء خاطئ ⚠️≫╾╼⪩\n\n*استخدم هذه الطريقة كمثال:*`, 
text1: `*تم تفعيله بنجاح*`,  
text2: `*لقد تم إيقافه!*`,  
text3: `*انتبه إلى جميع الأعضاء النشطين في هذه المجموعة 📣*\n\n*الرابط المضاد نشط*\n\n*ولن يتمكن سوى مسؤولي هذه المجموعة من تمرير الرابط*\n\nإذا كان أي مشارك ليس عضوًا إذا أرسل المشرف رابطًا من مجموعة أخرى سيتم حظره من هذه المجموعة فورًا`,
text4: `سوف يستجيب الروبوت فقط لمسؤولي المجموعة.`, 
text5: ` الآن يعمل الروبوت لجميع المشاركين في المجموعة  🥳` }

//grupo.js
const grupos = {
text: `*والنص?*`, 
text1: `*تم فتح المجموعة بنجاح ✅*`,
text2: `*تم إغلاق المجموعة بنجاح ✅*`, 
text3: `*أدخل رابط المجموعة*\n\n*📌 مثال:*`,
text4: `*لقد انضممت بالفعل 😼*`,    
text5: `📧 *تطبيق لمجموعة*\n\n*👤 الطالب*`, 
text6: `*🔮 وصلة*`, 
text7: `*✅ تم إرسال الرابط الخاص بك إلى مالكي*\n┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈\n⚠️ *سيتم تقييم مجموعتك وسيكون الأمر متروكًا للمالك ليقرر ما إذا كان الروبوت ينضم إلى المجموعة أم لا.*\n┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈\n❕ *قد يتم رفض طلبك للأسباب التالية:*\n*1️⃣ البوت مشبع.*\n┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈\n2️⃣ *تمت إزالة الروبوت من المجموعة.*\n┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈\n3️⃣ *المجموعة لا تلتزم بلوائح الروبوت*\n┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈\n4️⃣ *تمت استعادة رابط المجموعة.*\n┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈\n5️⃣ *لا يمكن إضافتها إلى المجموعة حسب مالكي*\n┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈\n📧 *قد يستغرق الرد على الطلب ساعات. يرجى التحلي بالصبر، وشكرا*\n┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈\n*يمكنك دعم الروبوت بنجمة صغيرة في مستودعنا الرسمي والاشتراك في قناتنا على موقع YouTube وإرسال لقطة شاشة إلى منشئ المحتوى الخاص بي حتى يتمكن من إضافة الروبوت إلى مجموعتك 💫*`, 
text8: `*[ بوت في مجموعتك ]*

يمكنك طلب ذلك عن طريق التبرع الطوعي من خلال Mercado Pago arg.

🚀 سيكون الروبوت نشطًا على مدار الساعة طوال أيام الأسبوع لمجموعتك.
 
*⚡أين يمكنني التبرع؟*
من خلال سوق الدفع لدينا.

❇️سوق الدفع:
• الاسم المستعار: elrebelde21
• CVU: 0000003100059201491917

*⚡لا أستطيع التبرع، هل هناك خيار آخر للحصول على بوت لمجموعتي؟*
يمكنك دعم مستودعنا الرسمي بنجمة صغيرة 🌟
• https://github.com/elrebelde21/NovaBot-MD

🔔 اشترك في قناتنا الرسمية على اليوتيوب
• https://www.youtube.com/@elrebelde.21

*⏩ الخطوة التالية ⏩*

بمجرد إجراء الدفع، يمكنك إبلاغ منشئ المحتوى الخاص بي وإرسال إثبات لإرسال الأموال (لقطة شاشة) حتى أتمكن من إضافة الروبوت إلى مجموعتك 👇.
https://chat.whatsapp.com/BvElRVdgTVW34KRXtnvBfB

*⚡هل سيكون البوت نشطًا على مدار الساعة طوال أيام الأسبوع؟*
نعم، تتم استضافة الروبوت الخاص بنا على خادم مدفوع للحفاظ على تشغيله على مدار الساعة طوال أيام الأسبوع (ولهذا السبب نطلب أيضًا التبرعات لاستمرار تشغيله).`, 
text9: `*⚠️ والصورة?*`,  
text10: `*⚠️ الرد على الصورة مع :*`, 
text11: `*✅ تم تغيير اسم المجموعة بشكل صحيح*`, 
text12: `*✅ تم تغيير وصف المجموعة بنجاح*`, 
text13: `*[ ⚠️ ] أدخل رقم الشخص الذي تريد إضافته*\n*مثال:*`, 
text14: `*⚠️ أدخل الرقم بدونه (+)*`, 
text15: `≡ *دعوة*\n\nمرحبًا أيها المستخدم، أدعوك للانضمام إلى هذه المجموعة.`, 
text16: `*[ ⚠️ ] من الذي أستبعده؟ ضع علامة على بعض المستخدمين، أنا لست توقعًا 😯*`, 
text17: `*[ ⚠️ ] من أعطي المشرف؟ ضع علامة على الشخص أو قم بالرد على رسائله*`, 
text18: `*[ ⚠️ ] من الذي قمت بإزالة المشرفين منه؟ ضع علامة على الشخص أو قم بالرد على رسائله*`, 
text19: `*بوت قبالة*`, 
text20: `*بوت على الإنترنت أنا متاح الآن ✅*`, 
text21: `❑ رسالة :`, 
text22: `*[ ⚠ ️] استخدم هذا الأمر فقط عندما تكون حالة الطوارئ*`, 
text23: `معلومات المجموعة`,  
text24: `*🔸️ اسم* :`,  
text25: `*🔸️ عضو* :`,  
text26: ` مشاركون`,  
text27: `*🔸️ منشئ المجموعة:*`, 
text28: `*🔸️ إعدادات المجموعة:*`, 
text29: `*🔸️ وصف* :`,     
text30: `[ ⚠️ ] الإشارة/الإشارة إلى شخص ما\n\n📌 مثال :`, 
text31: `✳️  لا يمكن العثور على المستخدمين في قاعدة البيانات الخاصة بي`,  
text32: `⚠️ *حذر المستخدمون* ⚠️`, 
text33: `*المستخدمين:*`,  
text34: `*تحذير:*`,  
text35: `*سبب:*`,   
text36: `⚠️ *تحذير* ⚠️ 
لقد تلقيت تحذيرًا من أحد المسؤولين`,  
text37: `إذا تلقيت تحذيرًا *4*، فسيتم إزالتك تلقائيًا من المجموعة`,  
text38: `⛔ لقد تجاوز المستخدم تحذير *4* وبالتالي سيتم إزالته`,  
text39: `⚠️ *تمت إزالة التحذير* ⚠️`, 
text40: `تحذير كامل:`,   
text41: `🔸️ قام أحد المسؤولين بتخفيض تحذيره، والآن قمت بذلك`,  
text42: `🔸️ ليس لدى المستخدمين أي تحذير` }

//juegos.js 
const juegos = {
text: `*🎅 والسؤال؟*\n\n*مثال:*`, 
text1: `*🤔 بسأل:*`, 
text2: `*🎅 إجابة:*`, 
text3: ` يجب أن تتزوج`, 
text4: ` إنهم يشكلون زوجين لطيفين 💕`, 
text5: `*أدخل @ أو اسم الشخص*`, 
text6: `🤤👅🥵 *لقد مارس الجنس معه للتو!*🥵👅🤤

لقد مارس الجنس للتو العاهرة`, 
text7: `على أربع بينما كانت تتأوه عليك كالعاهرة اللعينة "آآآه، آآه، استمري، لا تتوقفي، لا تتوقفي..." وقد تركتها مكسورة للغاية لدرجة أن العاهرات اللعينات لا يستطعن ​​حتى الصمود أجسادهم.!`, 
text8: `🤤🥵 *¡لقد مارس الجنس بالفعل!* 🥵🤤`, 
text9: ` هل فكرت في تكوين ثلاثي؟ أنت 3 تقوم بعمل ثلاثي جيد 😳😏`,  
text10: `*_😍 أفضل 5 ثنائيات في المجموعة 😍_*`, 
text11: `- مقدر لهذا الزوجين أن يكونا معًا 💙`, 
text12: `- هذان الزوجان طائرا حب صغيران في الحب ✨`, 
text13: `- Ufff وماذا أقول عن هذين الزوجين، يجب أن يكون لديهما عائلة 🤱🧑‍🍼`, 
text14: `- لقد تزوجا سرا بالفعل 💍`, 
text15: `- هذا الزوجان في شهر العسل ✨🥵😍❤️`, 
text16: `*[ ⚠️ ] اكتب اسم شخصين لحساب حبهم*`, 
text17: `* يا اكتب اسم الشخص الثاني*`,
text18: `*إدخال اسم?*`,  
text19: `*[ ⚠️ ] أدخل علامة @ لبعض المستخدمين*`, 
text20: `*[ ⚠️ ] أدخل المبلغ الذي تريد الرهان عليه*\n\n*📌 مثال:*`,  
text21: `⏳ يأمل`, 
text22: ` للمراهنة مرة أخرى`,  
text23: `*✳️ الحد الأدنى للرهان هو 100 خبرة*`, 
text24: `*✳️ ليس لديك الخبرة الكافية*`, 
text25: `🎁 اهزمك`, 
text26: `*🔮 لقد كدت أن تفعل ذلك! استمر في المحاولة*\n*خذ +20 تجربة*`, 
text27: `😔 لقد خسرت`,  
text28: `🥌 حجر 📄 ورق ✂️ مقص\n\n• يمكنك استخدام هذه الأوامر:\n🥌 #ppt piedra\n📄 #ppt papel\n✂️ #ppt tijera\n\n• استخدم الأحرف الصغيرة\n*مثال:* #ppt papel` }

//nsfw.js
const nsfw = {
text: `😐 أنت قاصر! اذهب للعب فري فاير 😆`, 
text1: `*هنا حقيبتي 🥵*`, 
text2: `*🥵 التمتع الفيديو 🥵` }

//propietario.js
const owner = {
text: `*أدخل النص الذي تريد بثه*`, 
text1: `*إرسال رسائل رسمية للحظة*`, 
text2: `「 ✅ *اعلان رسمي* ✅ 」`, 
text3: ` تمت عملية الإرسال بنجاح ✅ المجمو:`, 
text4: ` محادثات جماعية\nإجمالي وقت الشحن:`, 
text5: `*تم حظر المستخدم من البوت*`, 
text6: `*تم إلغاء حظر المستخدم*`, 
text7: `*[ ⚠️ ] يستجيب للملصق أو الصورة التي تريد إضافة أمر أو نص إليها*`, 
text8: `*⚠️ اذكر الرسالة*`, 
text9: `*[ ⚠️ ] خطأ في الاستخدام، نص مفقود*\n\n*مثال على الاستخدام الصحيح للأمر:*`, 
text10: `*[ ⚠️ ] ليس لديك الإذن بتغيير أمر الملصق هذا*`, 
text11: `*[ ✔ ] تمت إضافة النص/الأمر المخصص للملصق/الصورة إلى قاعدة البيانات بشكل صحيح*`, 
text12: `*معرف الملصق هذا غير موجود*`, 
text13: `*[ ⚠️ ] ليس لديك الإذن بتغيير أمر الملصق هذا*`, 
text14: `*قائمة الأوامر*\n▢ *معلومات:* إذا كان بالخط *الغامق* فهو محظور`, 
text15: `*[ ⚠️ ] ضع علامة على مستخدم باستخدام @tag*`, 
text16: `*[ ⚠️ ] أدخل كمية الماس التي تريد إضافتها*`, 
text17: `*[ ⚠️ ] رمز لا يعترف، الرقم الوحيد!*`, 
text18: `*[ ⚠️ ] الحد الأدنى لعدد الماسات المراد إضافتها هو 𝟷*`, 
text19: `*تمت إضافته*`, 
text20: `*[ ⚠️ ] أدخل مقدار الخبرة (XP) التي تريد إضافتها*`, 
text21: `*[ ⚠️ ] الحد الأدنى لعدد الخبرة (XP) المراد إضافتها هو 𝟷*`, 
text22: `*لن يتمكن المستخدم الذي تم حظره من استخدام أوامري بعد الآن*`, 
text23: `*تم إلغاء حظر المستخدم بنجاح ✅ الآن يمكنه استخدام الروبوت*`, 
text24: `✅ التغيير الناجح للاستخدام العام`, 
text25: `✅ التغيير الناجح إلى الاستخدام الخاص`, 
text26: `*وداعا، كان من دواعي سروري، أنت هنا، نراكم قريبا 👋*`, 
text27: `*إرسال نسخة احتياطية في لحظة*`, 
text28: `_🔄 إعادة تشغيل البوت..._` }

//randow.js
const ramdow = {
text: `*أنت قرنية 🥵🔥*`, 
text2: `_دينك هو أن تكون بسيطا!!_`, 
text3: `*اتصل بالشرطة!!* 😱`, 
text4: `*هل قمت بالتعليق على اليوتيوب؟!!* 😳` }

//rpg.js
const rpg = {
text: `[ 💤 لا تسميهم 💤 ]\n\nهؤلاء المستخدمون الذين يذكرون AFK هذا`, 
text1: `*لقد كنت غير نشط ل : `, 
text2: `*🕔 اخرج من هذا AFK 🕔*`, 
text3: ` المتصدرين`, 
text4: ` هذا المستخدمون`, 
text5: ` إنه غير نشط 😴\n💤 لا تسميهم 💤\n☣️ سبب :`, 
text6: `*🚓 لقد عاد*`, 
text7: `*اسم :*`, 
text8: `*يستخدم :*\n║ يمكنك شراء 💎 الماس\n║ باستخدام الأمر التالي:`, 
text9: `[ ⏳ ] انتظر`, 
text10: ` لي مرة أخرى`, 
text11: `⚒️ لطيف لي`, 
text12: `*🎅 لقد عملت كثيرًا بالفعل لهذا اليوم*`, 
text13: `*للعودة إلى العمل*`, 
text14: `🎁 *لقد قمت بالفعل بجمع مكافأتك اليومية*\n\n🕚 أعود للداخل :`, 
text15: `*🎁 يحصل على هدية عيد الميلاد 🎁🎅*

🎅 *لقد تلقيت:*`, 
text16: `*🎁 لقد جمعت بالفعل صدرك*\n🕚 لقد عاد:`, 
text17: `🛒 احصل على صدر`, 
unreg: `*✳️ أدخل الرقم التسلسلي، وتحقق من الرقم التسلسلي الخاص بك باستخدام الأمر:* #myns`, 
myns: `*⚠️ الرقم التسلسلي غير صحيح، استخدم:* #myns`, 
delreg: `*✅ تم حذف السجل*`, 
myns2: `👇 هذا هو الرقم التسلسلي الخاص بك:`, 
rob: `*⚠️ ضع علامة على شخص بوبو*`, 
rob2: `*😔 المستخدمين*`, 
rob3: `*فيها أقل من 15 ماسة، لا تسرق من شخص فقير*`, 
rob4: ` لديه خبرة أقل من 10، لا تسرق من فقير* v:`, 
rob5: `*لقد نهبت ⚔️ أ*`, 
rob6: ` مسروقة من قب:`, 
rob7: `*🚓🚓🚓 لا يمكنك سرقته لأن الشرطة تحمي هذا المستخدم 👮(AFK)*`, 
buy: `*مذكرة الدفع*`, 
buy2: `*قمت بشرائها :*`, 
buy3: `*لقد قضيت :*`, 
buy4: `🔶 ليس لديك الخبرة الكافية للشراء`, 
buy5: ` الماس 💎 يمكنك الحصول على الخبرة باستخدام الأمر #minar`, 
pp: `              *⪨ حساب تعريفي ⪩*`, 
pp2: `*🎅 اسم :*`, 
pp3: `*📱 رقم :*`, 
pp4: `*💎 الماس :*`, 
pp5: `*🆙 مستوى :*`, 
pp6: `*🏆 يتراوح :*`, 
pp7: `*📇 مسجل :*`, 
level: `*🎅 إحصائياتك 🆙*`, 
level2: `『 الإحصاءات الخاصة بك في الوقت الحقيقي 🕐 』`, 
level3: `🎅 *اسم:*`, 
level4: `🎊 أنت مفقود`, 
level5: `*XP* للارتقاء إلى المستوى الأعلى`, 
level6: ` هتافات\n├ الوصول إلى مستوى جديد 』`, 
level7: `*🎅 كلما زاد تفاعلك مع الروبوتات، كلما ارتفع مستواك*` }

//sticker.js
const sticker = {
text: `⏳ *انتظر لحظة أنا أقوم بإنشاء ملصقاتك....*`, 
text1: `_[ ❌ ] الحد الأقصى 20 ثانية!_`, 
text2: `*والصورة؟*`, 
text3: `*الرد على ملصق للسرقة`, 
text4: `أدخل شيئًا لتحويله إلى ملصق :v`, 
text5: `_*اهدأ يا صاح، سأجعل النص الخاص بك ملصقًا 👏*_\n\n_*قد يستغرق هذا بضع دقائق....*_` }
 
const idioma = (prefix) => { return `*✳️ ليستخدم:*\n${prefix}idioma 1 ( الأسبانية)\n${prefix}idioma 2 ( إنجليزي)\n${prefix}idioma 3 ( عرب)\n${prefix}idioma 4 ( إندونيسيا)\n${prefix}idioma 5 ( البرتغالية)\n${prefix}idioma 6 ( الروسية)\n\n*❗ مثال:*\n• ${prefix}idioma 1` } 
const idioma2 = () => { return `✅ تم تغيير اللغات بنجاح إلى` }

const smsReg = () => { return `*انت مسجل مسبقا 🧐*` }
const smsReg1 = (prefix) => { return `*❌ نموذج غير صحيح*\n\nاستخدم هذه الطريقة\nمثال: ${prefix}reg name.age` }
const smsReg2 = () => { return ` لا يمكن أن يكون الاسم فارغًا` }
const smsReg3 = () => { return ` لا يمكن أن يكون العمر فارغًا (الأرقام)` }
const smsReg4 = () => { return ' انها قديمة (。-`ω´-)' }
const smsReg5 = () => { return `🚼  بناءً على ذلك، يعرف الأطفال كيفية الكتابة.✍️😳` }
const smsReg6 = () => { return `🐈 فوا على هذا الأساس، الاسم طويل جدًا ويريد الجسر كاسم😹` }
const smsReg7 = (name, user, age, time, date, sender, sn, prefix, rtotalreg) => { return `[ ✅ اكتمل التسجيل ]\n\n ◉ *اسم:* ${name} ${user.registered === true ? 'ͧͧͧͦꙶͣͤ✓' : ''}\n ◉ *عمر:* ${age} سنين\n ◉ *ساعة:* ${time}\n ◉ *تاريخ:* ${date}\n ◉ *رقم:* wa.me/${sender.split("@")[0]}\n ◉ *رقم سري*\n ⤷ ${sn}\n\n 🎁 *جائزة:*\n ⤷ 2 الماس 💎\n ⤷ 200 خبرة\n\n *◉ لرؤية استخدام أوامر الروبوت:*
 ${prefix}menu\n\n ◉ *المستخدمين المسجلين:* ${rtotalreg}` }
const smsReg8 = () => { return `*💬 اختر لغتك مع:* #idioma` }
 
module.exports = { lenguaje, exito, tmp, session, errorsession, archivo, AvisoMG, archborrado, archivoborrado, purgesessions, purgesubbots, purgeoldfiles, smscall, smscall2, smsAvisos, smsAvisos2, smsAvisos3, smsAvisos4, smsAvisos5, smsAvisos6, smsAvisos7, smsAvisos8, smsAvisos9, smsWel, smsWel2, smsWel3, smsWel4, smsWel5, smsWel6, smsWel7, smsWel8, smsWel9, smsWel10, smsWel11, smsBye, smsBye2, smsBye3, smsBye4, smsBye5, smsConexion, smsEscaneaQR, smsConectado, smsConexioncerrar, nivel, nivel2, admin, botAdmin, propietario, group, private, bot, error, advertencia, registra, limit, AntiNsfw, endLimit, result, lengua, sms, Bio, smsAntiFake, smsAntiArabe, smsAntiLink, smsAntiLink2, smsAntiLink3, smsAntiLink4, smsAntiLink5, smsAutoSicker, smsAutonivel, smsAutonivel2, smsAutonivel3, smsAutonivel4, smsAutonivel5, smsAutonivel6, smsAutonivel7, smsAutonivel8, smsAutonivel9, smsAntiPv, info, menu, jadibot, descargar, demote, promote, enable, grupos, juegos, nsfw, owner, ramdow, rpg, sticker, idioma, idioma2, smsReg, smsReg1, smsReg2, smsReg3, smsReg4, smsReg5, smsReg6, smsReg7, smsReg8}